Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 818, Event Definition Register 6 */
#define MCDS_MCXEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010818u)

/** \brief 81C, Event Definition Register 7 */
#define MCDS_MCXEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA01081Cu)

/** \brief 820, Event Definition Register 8 */
#define MCDS_MCXEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010820u)

/** \brief 824, Event Definition Register 9 */
#define MCDS_MCXEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010824u)

/** \brief 828, Event Definition Register 10 */
#define MCDS_MCXEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010828u)

/** \brief 82C, Event Definition Register 11 */
#define MCDS_MCXEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA01082Cu)

/** \brief 830, Event Definition Register 12 */
#define MCDS_MCXEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010830u)

/** \brief 834, Event Definition Register 13 */
#define MCDS_MCXEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010834u)

/** \brief 838, Event Definition Register 14 */
#define MCDS_MCXEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010838u)

/** \brief 83C, Event Definition Register 15 */
#define MCDS_MCXEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA01083Cu)

/** \brief 840, Event Definition Register 16 */
#define MCDS_MCXEVT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010840u)

/** \brief 844, Event Definition Register 17 */
#define MCDS_MCXEVT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010844u)

/** \brief 848, Event Definition Register 18 */
#define MCDS_MCXEVT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010848u)

/** \brief 84C, Event Definition Register 19 */
#define MCDS_MCXEVT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA01084Cu)

/** \brief 850, Event Definition Register 20 */
#define MCDS_MCXEVT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010850u)

/** \brief 854, Event Definition Register 21 */
#define MCDS_MCXEVT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010854u)

/** \brief 858, Event Definition Register 22 */
#define MCDS_MCXEVT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010858u)

/** \brief 85C, Event Definition Register 23 */
#define MCDS_MCXEVT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA01085Cu)

/** \brief 880, Action Definition Register 0 */
#define MCDS_MCXACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010880u)

/** \brief 884, Action Definition Register 1 */
#define MCDS_MCXACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010884u)

/** \brief 888, Action Definition Register 2 */
#define MCDS_MCXACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010888u)

/** \brief 88C, Action Definition Register 3 */
#define MCDS_MCXACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01088Cu)

/** \brief 890, Action Definition Register 4 */
#define MCDS_MCXACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010890u)

/** \brief 894, Action Definition Register 5 */
#define MCDS_MCXACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010894u)

/** \brief 898, Action Definition Register 6 */
#define MCDS_MCXACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010898u)

/** \brief 89C, Action Definition Register 7 */
#define MCDS_MCXACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01089Cu)

/** \brief 8A0, Action Definition Register 8 */
#define MCDS_MCXACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108A0u)

/** \brief 8A4, Action Definition Register 9 */
#define MCDS_MCXACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108A4u)

/** \brief 8A8, Action Definition Register 10 */
#define MCDS_MCXACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108A8u)

/** \brief 8AC, Action Definition Register 11 */
#define MCDS_MCXACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108ACu)

/** \brief 8B0, Action Definition Register 12 */
#define MCDS_MCXACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108B0u)

/** \brief 8B4, Action Definition Register 13 */
#define MCDS_MCXACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108B4u)

/** \brief 8B8, Action Definition Register 14 */
#define MCDS_MCXACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108B8u)

/** \brief 8BC, Action Definition Register 15 */
#define MCDS_MCXACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108BCu)

/** \brief 8C0, Action Definition Register 16 */
#define MCDS_MCXACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108C0u)

/** \brief 8C4, Action Definition Register 17 */
#define MCDS_MCXACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108C4u)

/** \brief 8C8, Action Definition Register 18 */
#define MCDS_MCXACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108C8u)

/** \brief 8CC, Action Definition Register 19 */
#define MCDS_MCXACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108CCu)

/** \brief 8D0, Action Definition Register 20 */
#define MCDS_MCXACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108D0u)

/** \brief 8D4, Action Definition Register 21 */
#define MCDS_MCXACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108D4u)

/** \brief 8D8, Action Definition Register 22 */
#define MCDS_MCXACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108D8u)

/** \brief 8DC, Action Definition Register 23 */
#define MCDS_MCXACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108DCu)

/** \brief 8E0, Action Definition Register 24 */
#define MCDS_MCXACT24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108E0u)

/** \brief 8E4, Action Definition Register 25 */
#define MCDS_MCXACT25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108E4u)

