Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief B40, Counter Control Register */
#define MCDS_MCX20_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B40u)
/** Alias (User Manual Name) for MCDS_MCX20_CCL.
* To use register names with standard convension, please use MCDS_MCX20_CCL.
*/
#define MCDS_MCXCCL20 (MCDS_MCX20_CCL)

/** \brief B44, Counter Limit Register */
#define MCDS_MCX20_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B44u)
/** Alias (User Manual Name) for MCDS_MCX20_LMT.
* To use register names with standard convension, please use MCDS_MCX20_LMT.
*/
#define MCDS_MCXLMT20 (MCDS_MCX20_LMT)

/** \brief B48, Current Count Register */
#define MCDS_MCX20_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B48u)
/** Alias (User Manual Name) for MCDS_MCX20_CNT.
* To use register names with standard convension, please use MCDS_MCX20_CNT.
*/
#define MCDS_MCXCNT20 (MCDS_MCX20_CNT)

/** \brief B50, Counter Control Register */
#define MCDS_MCX21_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B50u)
/** Alias (User Manual Name) for MCDS_MCX21_CCL.
* To use register names with standard convension, please use MCDS_MCX21_CCL.
*/
#define MCDS_MCXCCL21 (MCDS_MCX21_CCL)

/** \brief B54, Counter Limit Register */
#define MCDS_MCX21_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B54u)
/** Alias (User Manual Name) for MCDS_MCX21_LMT.
* To use register names with standard convension, please use MCDS_MCX21_LMT.
*/
#define MCDS_MCXLMT21 (MCDS_MCX21_LMT)

/** \brief B58, Current Count Register */
#define MCDS_MCX21_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B58u)
/** Alias (User Manual Name) for MCDS_MCX21_CNT.
* To use register names with standard convension, please use MCDS_MCX21_CNT.
*/
#define MCDS_MCXCNT21 (MCDS_MCX21_CNT)

/** \brief B60, Counter Control Register */
#define MCDS_MCX22_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B60u)
/** Alias (User Manual Name) for MCDS_MCX22_CCL.
* To use register names with standard convension, please use MCDS_MCX22_CCL.
*/
#define MCDS_MCXCCL22 (MCDS_MCX22_CCL)

/** \brief B64, Counter Limit Register */
#define MCDS_MCX22_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B64u)
/** Alias (User Manual Name) for MCDS_MCX22_LMT.
* To use register names with standard convension, please use MCDS_MCX22_LMT.
*/
#define MCDS_MCXLMT22 (MCDS_MCX22_LMT)

/** \brief B68, Current Count Register */
#define MCDS_MCX22_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B68u)
/** Alias (User Manual Name) for MCDS_MCX22_CNT.
* To use register names with standard convension, please use MCDS_MCX22_CNT.
*/
#define MCDS_MCXCNT22 (MCDS_MCX22_CNT)

/** \brief B70, Counter Control Register */
#define MCDS_MCX23_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B70u)
/** Alias (User Manual Name) for MCDS_MCX23_CCL.
* To use register names with standard convension, please use MCDS_MCX23_CCL.
*/
#define MCDS_MCXCCL23 (MCDS_MCX23_CCL)

/** \brief B74, Counter Limit Register */
#define MCDS_MCX23_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B74u)
/** Alias (User Manual Name) for MCDS_MCX23_LMT.
* To use register names with standard convension, please use MCDS_MCX23_LMT.
*/
#define MCDS_MCXLMT23 (MCDS_MCX23_LMT)

/** \brief B78, Current Count Register */
#define MCDS_MCX23_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B78u)
/** Alias (User Manual Name) for MCDS_MCX23_CNT.
* To use register names with standard convension, please use MCDS_MCX23_CNT.
*/
#define MCDS_MCXCNT23 (MCDS_MCX23_CNT)

/** \brief B80, Counter Control Register */
#define MCDS_MCX24_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B80u)
/** Alias (User Manual Name) for MCDS_MCX24_CCL.
* To use register names with standard convension, please use MCDS_MCX24_CCL.
*/
#define MCDS_MCXCCL24 (MCDS_MCX24_CCL)

/** \brief B84, Counter Limit Register */
#define MCDS_MCX24_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B84u)
/** Alias (User Manual Name) for MCDS_MCX24_LMT.
* To use register names with standard convension, please use MCDS_MCX24_LMT.
*/
#define MCDS_MCXLMT24 (MCDS_MCX24_LMT)

/** \brief B88, Current Count Register */
#define MCDS_MCX24_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B88u)
/** Alias (User Manual Name) for MCDS_MCX24_CNT.
* To use register names with standard convension, please use MCDS_MCX24_CNT.
*/
#define MCDS_MCXCNT24 (MCDS_MCX24_CNT)

/** \brief B90, Counter Control Register */
#define MCDS_MCX25_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B90u)
/** Alias (User Manual Name) for MCDS_MCX25_CCL.
* To use register names with standard convension, please use MCDS_MCX25_CCL.
*/
#define MCDS_MCXCCL25 (MCDS_MCX25_CCL)

/** \brief B94, Counter Limit Register */
#define MCDS_MCX25_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B94u)
/** Alias (User Manual Name) for MCDS_MCX25_LMT.
* To use register names with standard convension, please use MCDS_MCX25_LMT.
*/
#define MCDS_MCXLMT25 (MCDS_MCX25_LMT)

/** \brief B98, Current Count Register */
#define MCDS_MCX25_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B98u)
/** Alias (User Manual Name) for MCDS_MCX25_CNT.
* To use register names with standard convension, please use MCDS_MCX25_CNT.
*/
#define MCDS_MCXCNT25 (MCDS_MCX25_CNT)

/** \brief BA0, Counter Control Register */
#define MCDS_MCX26_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BA0u)
/** Alias (User Manual Name) for MCDS_MCX26_CCL.
* To use register names with standard convension, please use MCDS_MCX26_CCL.
*/
#define MCDS_MCXCCL26 (MCDS_MCX26_CCL)

/** \brief BA4, Counter Limit Register */
#define MCDS_MCX26_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BA4u)
/** Alias (User Manual Name) for MCDS_MCX26_LMT.
* To use register names with standard convension, please use MCDS_MCX26_LMT.
*/
#define MCDS_MCXLMT26 (MCDS_MCX26_LMT)

/** \brief BA8, Current Count Register */
#define MCDS_MCX26_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BA8u)
/** Alias (User Manual Name) for MCDS_MCX26_CNT.
* To use register names with standard convension, please use MCDS_MCX26_CNT.
*/
#define MCDS_MCXCNT26 (MCDS_MCX26_CNT)

/** \brief BB0, Counter Control Register */
#define MCDS_MCX27_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BB0u)
/** Alias (User Manual Name) for MCDS_MCX27_CCL.
* To use register names with standard convension, please use MCDS_MCX27_CCL.
*/
#define MCDS_MCXCCL27 (MCDS_MCX27_CCL)

