Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief BB4, Counter Limit Register */
#define MCDS_MCX27_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BB4u)
/** Alias (User Manual Name) for MCDS_MCX27_LMT.
* To use register names with standard convension, please use MCDS_MCX27_LMT.
*/
#define MCDS_MCXLMT27 (MCDS_MCX27_LMT)

/** \brief BB8, Current Count Register */
#define MCDS_MCX27_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BB8u)
/** Alias (User Manual Name) for MCDS_MCX27_CNT.
* To use register names with standard convension, please use MCDS_MCX27_CNT.
*/
#define MCDS_MCXCNT27 (MCDS_MCX27_CNT)

/** \brief BC0, Counter Control Register */
#define MCDS_MCX28_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BC0u)
/** Alias (User Manual Name) for MCDS_MCX28_CCL.
* To use register names with standard convension, please use MCDS_MCX28_CCL.
*/
#define MCDS_MCXCCL28 (MCDS_MCX28_CCL)

/** \brief BC4, Counter Limit Register */
#define MCDS_MCX28_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BC4u)
/** Alias (User Manual Name) for MCDS_MCX28_LMT.
* To use register names with standard convension, please use MCDS_MCX28_LMT.
*/
#define MCDS_MCXLMT28 (MCDS_MCX28_LMT)

/** \brief BC8, Current Count Register */
#define MCDS_MCX28_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BC8u)
/** Alias (User Manual Name) for MCDS_MCX28_CNT.
* To use register names with standard convension, please use MCDS_MCX28_CNT.
*/
#define MCDS_MCXCNT28 (MCDS_MCX28_CNT)

/** \brief BD0, Counter Control Register */
#define MCDS_MCX29_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BD0u)
/** Alias (User Manual Name) for MCDS_MCX29_CCL.
* To use register names with standard convension, please use MCDS_MCX29_CCL.
*/
#define MCDS_MCXCCL29 (MCDS_MCX29_CCL)

/** \brief BD4, Counter Limit Register */
#define MCDS_MCX29_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BD4u)
/** Alias (User Manual Name) for MCDS_MCX29_LMT.
* To use register names with standard convension, please use MCDS_MCX29_LMT.
*/
#define MCDS_MCXLMT29 (MCDS_MCX29_LMT)

/** \brief BD8, Current Count Register */
#define MCDS_MCX29_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BD8u)
/** Alias (User Manual Name) for MCDS_MCX29_CNT.
* To use register names with standard convension, please use MCDS_MCX29_CNT.
*/
#define MCDS_MCXCNT29 (MCDS_MCX29_CNT)

/** \brief BE0, Counter Control Register */
#define MCDS_MCX30_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BE0u)
/** Alias (User Manual Name) for MCDS_MCX30_CCL.
* To use register names with standard convension, please use MCDS_MCX30_CCL.
*/
#define MCDS_MCXCCL30 (MCDS_MCX30_CCL)

/** \brief BE4, Counter Limit Register */
#define MCDS_MCX30_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BE4u)
/** Alias (User Manual Name) for MCDS_MCX30_LMT.
* To use register names with standard convension, please use MCDS_MCX30_LMT.
*/
#define MCDS_MCXLMT30 (MCDS_MCX30_LMT)

/** \brief BE8, Current Count Register */
#define MCDS_MCX30_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BE8u)
/** Alias (User Manual Name) for MCDS_MCX30_CNT.
* To use register names with standard convension, please use MCDS_MCX30_CNT.
*/
#define MCDS_MCXCNT30 (MCDS_MCX30_CNT)

/** \brief BF0, Counter Control Register */
#define MCDS_MCX31_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BF0u)
/** Alias (User Manual Name) for MCDS_MCX31_CCL.
* To use register names with standard convension, please use MCDS_MCX31_CCL.
*/
#define MCDS_MCXCCL31 (MCDS_MCX31_CCL)

/** \brief BF4, Counter Limit Register */
#define MCDS_MCX31_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BF4u)
/** Alias (User Manual Name) for MCDS_MCX31_LMT.
* To use register names with standard convension, please use MCDS_MCX31_LMT.
*/
#define MCDS_MCXLMT31 (MCDS_MCX31_LMT)

/** \brief BF8, Current Count Register */
#define MCDS_MCX31_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BF8u)
/** Alias (User Manual Name) for MCDS_MCX31_CNT.
* To use register names with standard convension, please use MCDS_MCX31_CNT.
*/
#define MCDS_MCXCNT31 (MCDS_MCX31_CNT)

/** \brief C00, Performance Counter Configuration Register */
#define MCDS_MCXPERFCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXPERFCFG*)0xFA010C00u)

/** \brief 2000, Debug Status Register */
#define MCDS_TCXDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXDCSTS*)0xFA012000u)

/** \brief 2004, Current Process ID */
#define MCDS_TCXCID /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXCID*)0xFA012004u)

/** \brief 2008, Current Instruction Pointer */
#define MCDS_TCXCIP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXCIP*)0xFA012008u)

/** \brief 200C, Compact Function Trace Register */
#define MCDS_TCXCFT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXCFT*)0xFA01200Cu)

/** \brief 2200, Lookup Table Data Register */
#define MCDS_TCXPALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPALLUTD*)0xFA012200u)

/** \brief 2204, Lookup Table Address Register */
#define MCDS_TCXPALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPALLUTA*)0xFA012204u)

/** \brief 2210, Lookup Table Base Register */
#define MCDS_TCXPAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_BND*)0xFA012210u)
/** Alias (User Manual Name) for MCDS_TCXPAL0_BND.
* To use register names with standard convension, please use MCDS_TCXPAL0_BND.
*/
#define MCDS_TCXPALBND0 (MCDS_TCXPAL0_BND)

/** \brief 2214, Lookup Table Range Register */
#define MCDS_TCXPAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_RNG*)0xFA012214u)
/** Alias (User Manual Name) for MCDS_TCXPAL0_RNG.
* To use register names with standard convension, please use MCDS_TCXPAL0_RNG.
*/
#define MCDS_TCXPALRNG0 (MCDS_TCXPAL0_RNG)

/** \brief 2218, Lookup Table Mapping Register */
#define MCDS_TCXPAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_MAP*)0xFA012218u)
/** Alias (User Manual Name) for MCDS_TCXPAL0_MAP.
* To use register names with standard convension, please use MCDS_TCXPAL0_MAP.
*/
#define MCDS_TCXPALMAP0 (MCDS_TCXPAL0_MAP)

/** \brief 2220, Lookup Table Base Register */
#define MCDS_TCXPAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_BND*)0xFA012220u)
/** Alias (User Manual Name) for MCDS_TCXPAL1_BND.
* To use register names with standard convension, please use MCDS_TCXPAL1_BND.
*/
#define MCDS_TCXPALBND1 (MCDS_TCXPAL1_BND)

/** \brief 2224, Lookup Table Range Register */
#define MCDS_TCXPAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_RNG*)0xFA012224u)
/** Alias (User Manual Name) for MCDS_TCXPAL1_RNG.
* To use register names with standard convension, please use MCDS_TCXPAL1_RNG.
*/
#define MCDS_TCXPALRNG1 (MCDS_TCXPAL1_RNG)

/** \brief 2228, Lookup Table Mapping Register */
#define MCDS_TCXPAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_MAP*)0xFA012228u)
/** Alias (User Manual Name) for MCDS_TCXPAL1_MAP.
* To use register names with standard convension, please use MCDS_TCXPAL1_MAP.
*/
#define MCDS_TCXPALMAP1 (MCDS_TCXPAL1_MAP)

