Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 2230, Lookup Table Base Register */
#define MCDS_TCXPAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_BND*)0xFA012230u)
/** Alias (User Manual Name) for MCDS_TCXPAL2_BND.
* To use register names with standard convension, please use MCDS_TCXPAL2_BND.
*/
#define MCDS_TCXPALBND2 (MCDS_TCXPAL2_BND)

/** \brief 2234, Lookup Table Range Register */
#define MCDS_TCXPAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_RNG*)0xFA012234u)
/** Alias (User Manual Name) for MCDS_TCXPAL2_RNG.
* To use register names with standard convension, please use MCDS_TCXPAL2_RNG.
*/
#define MCDS_TCXPALRNG2 (MCDS_TCXPAL2_RNG)

/** \brief 2238, Lookup Table Mapping Register */
#define MCDS_TCXPAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_MAP*)0xFA012238u)
/** Alias (User Manual Name) for MCDS_TCXPAL2_MAP.
* To use register names with standard convension, please use MCDS_TCXPAL2_MAP.
*/
#define MCDS_TCXPALMAP2 (MCDS_TCXPAL2_MAP)

/** \brief 2240, Lookup Table Base Register */
#define MCDS_TCXPAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_BND*)0xFA012240u)
/** Alias (User Manual Name) for MCDS_TCXPAL3_BND.
* To use register names with standard convension, please use MCDS_TCXPAL3_BND.
*/
#define MCDS_TCXPALBND3 (MCDS_TCXPAL3_BND)

/** \brief 2244, Lookup Table Range Register */
#define MCDS_TCXPAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_RNG*)0xFA012244u)
/** Alias (User Manual Name) for MCDS_TCXPAL3_RNG.
* To use register names with standard convension, please use MCDS_TCXPAL3_RNG.
*/
#define MCDS_TCXPALRNG3 (MCDS_TCXPAL3_RNG)

/** \brief 2248, Lookup Table Mapping Register */
#define MCDS_TCXPAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_MAP*)0xFA012248u)
/** Alias (User Manual Name) for MCDS_TCXPAL3_MAP.
* To use register names with standard convension, please use MCDS_TCXPAL3_MAP.
*/
#define MCDS_TCXPALMAP3 (MCDS_TCXPAL3_MAP)

/** \brief 2400, Comparator Bound Register 0 */
#define MCDS_TCXEA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012400u)
/** Alias (User Manual Name) for MCDS_TCXEA0_BND.
* To use register names with standard convension, please use MCDS_TCXEA0_BND.
*/
#define MCDS_TCXEABND0 (MCDS_TCXEA0_BND)

/** \brief 2404, Comparator Range Register 0 */
#define MCDS_TCXEA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012404u)
/** Alias (User Manual Name) for MCDS_TCXEA0_RNG.
* To use register names with standard convension, please use MCDS_TCXEA0_RNG.
*/
#define MCDS_TCXEARNG0 (MCDS_TCXEA0_RNG)

/** \brief 2410, Comparator Bound Register 1 */
#define MCDS_TCXEA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012410u)
/** Alias (User Manual Name) for MCDS_TCXEA1_BND.
* To use register names with standard convension, please use MCDS_TCXEA1_BND.
*/
#define MCDS_TCXEABND1 (MCDS_TCXEA1_BND)

/** \brief 2414, Comparator Range Register 1 */
#define MCDS_TCXEA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012414u)
/** Alias (User Manual Name) for MCDS_TCXEA1_RNG.
* To use register names with standard convension, please use MCDS_TCXEA1_RNG.
*/
#define MCDS_TCXEARNG1 (MCDS_TCXEA1_RNG)

/** \brief 2420, Comparator Bound Register 2 */
#define MCDS_TCXEA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012420u)
/** Alias (User Manual Name) for MCDS_TCXEA2_BND.
* To use register names with standard convension, please use MCDS_TCXEA2_BND.
*/
#define MCDS_TCXEABND2 (MCDS_TCXEA2_BND)

/** \brief 2424, Comparator Range Register 2 */
#define MCDS_TCXEA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012424u)
/** Alias (User Manual Name) for MCDS_TCXEA2_RNG.
* To use register names with standard convension, please use MCDS_TCXEA2_RNG.
*/
#define MCDS_TCXEARNG2 (MCDS_TCXEA2_RNG)

/** \brief 2430, Comparator Bound Register 3 */
#define MCDS_TCXEA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012430u)
/** Alias (User Manual Name) for MCDS_TCXEA3_BND.
* To use register names with standard convension, please use MCDS_TCXEA3_BND.
*/
#define MCDS_TCXEABND3 (MCDS_TCXEA3_BND)

/** \brief 2434, Comparator Range Register 3 */
#define MCDS_TCXEA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012434u)
/** Alias (User Manual Name) for MCDS_TCXEA3_RNG.
* To use register names with standard convension, please use MCDS_TCXEA3_RNG.
*/
#define MCDS_TCXEARNG3 (MCDS_TCXEA3_RNG)

/** \brief 2440, Comparator Bound Register 4 */
#define MCDS_TCXEA4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012440u)
/** Alias (User Manual Name) for MCDS_TCXEA4_BND.
* To use register names with standard convension, please use MCDS_TCXEA4_BND.
*/
#define MCDS_TCXEABND4 (MCDS_TCXEA4_BND)

/** \brief 2444, Comparator Range Register 4 */
#define MCDS_TCXEA4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012444u)
/** Alias (User Manual Name) for MCDS_TCXEA4_RNG.
* To use register names with standard convension, please use MCDS_TCXEA4_RNG.
*/
#define MCDS_TCXEARNG4 (MCDS_TCXEA4_RNG)

/** \brief 2450, Comparator Bound Register 5 */
#define MCDS_TCXEA5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012450u)
/** Alias (User Manual Name) for MCDS_TCXEA5_BND.
* To use register names with standard convension, please use MCDS_TCXEA5_BND.
*/
#define MCDS_TCXEABND5 (MCDS_TCXEA5_BND)

/** \brief 2454, Comparator Range Register 5 */
#define MCDS_TCXEA5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012454u)
/** Alias (User Manual Name) for MCDS_TCXEA5_RNG.
* To use register names with standard convension, please use MCDS_TCXEA5_RNG.
*/
#define MCDS_TCXEARNG5 (MCDS_TCXEA5_RNG)

/** \brief 2460, Comparator Bound Register 6 */
#define MCDS_TCXEA6_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012460u)
/** Alias (User Manual Name) for MCDS_TCXEA6_BND.
* To use register names with standard convension, please use MCDS_TCXEA6_BND.
*/
#define MCDS_TCXEABND6 (MCDS_TCXEA6_BND)

/** \brief 2464, Comparator Range Register 6 */
#define MCDS_TCXEA6_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012464u)
/** Alias (User Manual Name) for MCDS_TCXEA6_RNG.
* To use register names with standard convension, please use MCDS_TCXEA6_RNG.
*/
#define MCDS_TCXEARNG6 (MCDS_TCXEA6_RNG)

