Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 4470, Comparator Bound Register 7 */
#define MCDS_TCYEA7_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014470u)
/** Alias (User Manual Name) for MCDS_TCYEA7_BND.
* To use register names with standard convension, please use MCDS_TCYEA7_BND.
*/
#define MCDS_TCYEABND7 (MCDS_TCYEA7_BND)

/** \brief 4474, Comparator Range Register 7 */
#define MCDS_TCYEA7_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014474u)
/** Alias (User Manual Name) for MCDS_TCYEA7_RNG.
* To use register names with standard convension, please use MCDS_TCYEA7_RNG.
*/
#define MCDS_TCYEARNG7 (MCDS_TCYEA7_RNG)

/** \brief 4480, Comparator Bound Register 0 */
#define MCDS_TCYWD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_BND*)0xFA014480u)
/** Alias (User Manual Name) for MCDS_TCYWD0_BND.
* To use register names with standard convension, please use MCDS_TCYWD0_BND.
*/
#define MCDS_TCYWDBND0 (MCDS_TCYWD0_BND)

/** \brief 4484, Comparator Bound Register 0 */
#define MCDS_TCYWD0_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HBND*)0xFA014484u)
/** Alias (User Manual Name) for MCDS_TCYWD0_HBND.
* To use register names with standard convension, please use MCDS_TCYWD0_HBND.
*/
#define MCDS_TCYWDHBND0 (MCDS_TCYWD0_HBND)

/** \brief 4488, Comparator Range Register 0 */
#define MCDS_TCYWD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_RNG*)0xFA014488u)
/** Alias (User Manual Name) for MCDS_TCYWD0_RNG.
* To use register names with standard convension, please use MCDS_TCYWD0_RNG.
*/
#define MCDS_TCYWDRNG0 (MCDS_TCYWD0_RNG)

/** \brief 448C, Comparator Range Register 0 */
#define MCDS_TCYWD0_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HRNG*)0xFA01448Cu)
/** Alias (User Manual Name) for MCDS_TCYWD0_HRNG.
* To use register names with standard convension, please use MCDS_TCYWD0_HRNG.
*/
#define MCDS_TCYWDHRNG0 (MCDS_TCYWD0_HRNG)

/** \brief 4490, Comparator Mask Register 0 */
#define MCDS_TCYWD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_MSK*)0xFA014490u)
/** Alias (User Manual Name) for MCDS_TCYWD0_MSK.
* To use register names with standard convension, please use MCDS_TCYWD0_MSK.
*/
#define MCDS_TCYWDMSK0 (MCDS_TCYWD0_MSK)

/** \brief 4494, Comparator Mask Register 0 */
#define MCDS_TCYWD0_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HMSK*)0xFA014494u)
/** Alias (User Manual Name) for MCDS_TCYWD0_HMSK.
* To use register names with standard convension, please use MCDS_TCYWD0_HMSK.
*/
#define MCDS_TCYWDHMSK0 (MCDS_TCYWD0_HMSK)

/** \brief 449C, Comparator Sign Register 0 */
#define MCDS_TCYWD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_SGN*)0xFA01449Cu)
/** Alias (User Manual Name) for MCDS_TCYWD0_SGN.
* To use register names with standard convension, please use MCDS_TCYWD0_SGN.
*/
#define MCDS_TCYWDSGN0 (MCDS_TCYWD0_SGN)

/** \brief 44A0, Comparator Bound Register 1 */
#define MCDS_TCYWD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_BND*)0xFA0144A0u)
/** Alias (User Manual Name) for MCDS_TCYWD1_BND.
* To use register names with standard convension, please use MCDS_TCYWD1_BND.
*/
#define MCDS_TCYWDBND1 (MCDS_TCYWD1_BND)

/** \brief 44A4, Comparator Bound Register 1 */
#define MCDS_TCYWD1_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HBND*)0xFA0144A4u)
/** Alias (User Manual Name) for MCDS_TCYWD1_HBND.
* To use register names with standard convension, please use MCDS_TCYWD1_HBND.
*/
#define MCDS_TCYWDHBND1 (MCDS_TCYWD1_HBND)

/** \brief 44A8, Comparator Range Register 1 */
#define MCDS_TCYWD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_RNG*)0xFA0144A8u)
/** Alias (User Manual Name) for MCDS_TCYWD1_RNG.
* To use register names with standard convension, please use MCDS_TCYWD1_RNG.
*/
#define MCDS_TCYWDRNG1 (MCDS_TCYWD1_RNG)

/** \brief 44AC, Comparator Range Register 1 */
#define MCDS_TCYWD1_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HRNG*)0xFA0144ACu)
/** Alias (User Manual Name) for MCDS_TCYWD1_HRNG.
* To use register names with standard convension, please use MCDS_TCYWD1_HRNG.
*/
#define MCDS_TCYWDHRNG1 (MCDS_TCYWD1_HRNG)

/** \brief 44B0, Comparator Mask Register 1 */
#define MCDS_TCYWD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_MSK*)0xFA0144B0u)
/** Alias (User Manual Name) for MCDS_TCYWD1_MSK.
* To use register names with standard convension, please use MCDS_TCYWD1_MSK.
*/
#define MCDS_TCYWDMSK1 (MCDS_TCYWD1_MSK)

/** \brief 44B4, Comparator Mask Register 1 */
#define MCDS_TCYWD1_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HMSK*)0xFA0144B4u)
/** Alias (User Manual Name) for MCDS_TCYWD1_HMSK.
* To use register names with standard convension, please use MCDS_TCYWD1_HMSK.
*/
#define MCDS_TCYWDHMSK1 (MCDS_TCYWD1_HMSK)

/** \brief 44BC, Comparator Sign Register 1 */
#define MCDS_TCYWD1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_SGN*)0xFA0144BCu)
/** Alias (User Manual Name) for MCDS_TCYWD1_SGN.
* To use register names with standard convension, please use MCDS_TCYWD1_SGN.
*/
#define MCDS_TCYWDSGN1 (MCDS_TCYWD1_SGN)

/** \brief 44C0, Comparator Bound Register 2 */
#define MCDS_TCYWD2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_BND*)0xFA0144C0u)
/** Alias (User Manual Name) for MCDS_TCYWD2_BND.
* To use register names with standard convension, please use MCDS_TCYWD2_BND.
*/
#define MCDS_TCYWDBND2 (MCDS_TCYWD2_BND)

/** \brief 44C4, Comparator Bound Register 2 */
#define MCDS_TCYWD2_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HBND*)0xFA0144C4u)
/** Alias (User Manual Name) for MCDS_TCYWD2_HBND.
* To use register names with standard convension, please use MCDS_TCYWD2_HBND.
*/
#define MCDS_TCYWDHBND2 (MCDS_TCYWD2_HBND)

/** \brief 44C8, Comparator Range Register 2 */
#define MCDS_TCYWD2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_RNG*)0xFA0144C8u)
/** Alias (User Manual Name) for MCDS_TCYWD2_RNG.
* To use register names with standard convension, please use MCDS_TCYWD2_RNG.
*/
#define MCDS_TCYWDRNG2 (MCDS_TCYWD2_RNG)

/** \brief 44CC, Comparator Range Register 2 */
#define MCDS_TCYWD2_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HRNG*)0xFA0144CCu)
/** Alias (User Manual Name) for MCDS_TCYWD2_HRNG.
* To use register names with standard convension, please use MCDS_TCYWD2_HRNG.
*/
#define MCDS_TCYWDHRNG2 (MCDS_TCYWD2_HRNG)

/** \brief 44D0, Comparator Mask Register 2 */
#define MCDS_TCYWD2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_MSK*)0xFA0144D0u)
/** Alias (User Manual Name) for MCDS_TCYWD2_MSK.
* To use register names with standard convension, please use MCDS_TCYWD2_MSK.
*/
#define MCDS_TCYWDMSK2 (MCDS_TCYWD2_MSK)

/** \brief 44D4, Comparator Mask Register 2 */
#define MCDS_TCYWD2_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HMSK*)0xFA0144D4u)
/** Alias (User Manual Name) for MCDS_TCYWD2_HMSK.
* To use register names with standard convension, please use MCDS_TCYWD2_HMSK.
*/
#define MCDS_TCYWDHMSK2 (MCDS_TCYWD2_HMSK)

