Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 6494, Comparator Range Register 1 */
#define MCDS_SPBWD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_RNG*)0xFA016494u)
/** Alias (User Manual Name) for MCDS_SPBWD1_RNG.
* To use register names with standard convension, please use MCDS_SPBWD1_RNG.
*/
#define MCDS_SPBWDRNG1 (MCDS_SPBWD1_RNG)

/** \brief 6498, Comparator Mask Register 1 */
#define MCDS_SPBWD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_MSK*)0xFA016498u)
/** Alias (User Manual Name) for MCDS_SPBWD1_MSK.
* To use register names with standard convension, please use MCDS_SPBWD1_MSK.
*/
#define MCDS_SPBWDMSK1 (MCDS_SPBWD1_MSK)

/** \brief 649C, Comparator Sign Register 1 */
#define MCDS_SPBWD1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_SGN*)0xFA01649Cu)
/** Alias (User Manual Name) for MCDS_SPBWD1_SGN.
* To use register names with standard convension, please use MCDS_SPBWD1_SGN.
*/
#define MCDS_SPBWDSGN1 (MCDS_SPBWD1_SGN)

/** \brief 64A0, Comparator Bound Register 2 */
#define MCDS_SPBWD2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_BND*)0xFA0164A0u)
/** Alias (User Manual Name) for MCDS_SPBWD2_BND.
* To use register names with standard convension, please use MCDS_SPBWD2_BND.
*/
#define MCDS_SPBWDBND2 (MCDS_SPBWD2_BND)

/** \brief 64A4, Comparator Range Register 2 */
#define MCDS_SPBWD2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_RNG*)0xFA0164A4u)
/** Alias (User Manual Name) for MCDS_SPBWD2_RNG.
* To use register names with standard convension, please use MCDS_SPBWD2_RNG.
*/
#define MCDS_SPBWDRNG2 (MCDS_SPBWD2_RNG)

/** \brief 64A8, Comparator Mask Register 2 */
#define MCDS_SPBWD2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_MSK*)0xFA0164A8u)
/** Alias (User Manual Name) for MCDS_SPBWD2_MSK.
* To use register names with standard convension, please use MCDS_SPBWD2_MSK.
*/
#define MCDS_SPBWDMSK2 (MCDS_SPBWD2_MSK)

/** \brief 64AC, Comparator Sign Register 2 */
#define MCDS_SPBWD2_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_SGN*)0xFA0164ACu)
/** Alias (User Manual Name) for MCDS_SPBWD2_SGN.
* To use register names with standard convension, please use MCDS_SPBWD2_SGN.
*/
#define MCDS_SPBWDSGN2 (MCDS_SPBWD2_SGN)

/** \brief 64B0, Comparator Bound Register 3 */
#define MCDS_SPBWD3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_BND*)0xFA0164B0u)
/** Alias (User Manual Name) for MCDS_SPBWD3_BND.
* To use register names with standard convension, please use MCDS_SPBWD3_BND.
*/
#define MCDS_SPBWDBND3 (MCDS_SPBWD3_BND)

/** \brief 64B4, Comparator Range Register 3 */
#define MCDS_SPBWD3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_RNG*)0xFA0164B4u)
/** Alias (User Manual Name) for MCDS_SPBWD3_RNG.
* To use register names with standard convension, please use MCDS_SPBWD3_RNG.
*/
#define MCDS_SPBWDRNG3 (MCDS_SPBWD3_RNG)

/** \brief 64B8, Comparator Mask Register 3 */
#define MCDS_SPBWD3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_MSK*)0xFA0164B8u)
/** Alias (User Manual Name) for MCDS_SPBWD3_MSK.
* To use register names with standard convension, please use MCDS_SPBWD3_MSK.
*/
#define MCDS_SPBWDMSK3 (MCDS_SPBWD3_MSK)

/** \brief 64BC, Comparator Sign Register 3 */
#define MCDS_SPBWD3_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_SGN*)0xFA0164BCu)
/** Alias (User Manual Name) for MCDS_SPBWD3_SGN.
* To use register names with standard convension, please use MCDS_SPBWD3_SGN.
*/
#define MCDS_SPBWDSGN3 (MCDS_SPBWD3_SGN)

/** \brief 6500, Comparator Bound Register 0 */
#define MCDS_SPBAC0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_BND*)0xFA016500u)
/** Alias (User Manual Name) for MCDS_SPBAC0_BND.
* To use register names with standard convension, please use MCDS_SPBAC0_BND.
*/
#define MCDS_SPBACBND0 (MCDS_SPBAC0_BND)

/** \brief 6504, Comparator Range Register 0 */
#define MCDS_SPBAC0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_RNG*)0xFA016504u)
/** Alias (User Manual Name) for MCDS_SPBAC0_RNG.
* To use register names with standard convension, please use MCDS_SPBAC0_RNG.
*/
#define MCDS_SPBACRNG0 (MCDS_SPBAC0_RNG)

/** \brief 6508, Comparator Mask Register 0 */
#define MCDS_SPBAC0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_MSK*)0xFA016508u)
/** Alias (User Manual Name) for MCDS_SPBAC0_MSK.
* To use register names with standard convension, please use MCDS_SPBAC0_MSK.
*/
#define MCDS_SPBACMSK0 (MCDS_SPBAC0_MSK)

/** \brief 6510, Comparator Bound Register 1 */
#define MCDS_SPBAC1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_BND*)0xFA016510u)
/** Alias (User Manual Name) for MCDS_SPBAC1_BND.
* To use register names with standard convension, please use MCDS_SPBAC1_BND.
*/
#define MCDS_SPBACBND1 (MCDS_SPBAC1_BND)

/** \brief 6514, Comparator Range Register 1 */
#define MCDS_SPBAC1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_RNG*)0xFA016514u)
/** Alias (User Manual Name) for MCDS_SPBAC1_RNG.
* To use register names with standard convension, please use MCDS_SPBAC1_RNG.
*/
#define MCDS_SPBACRNG1 (MCDS_SPBAC1_RNG)

/** \brief 6518, Comparator Mask Register 1 */
#define MCDS_SPBAC1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_MSK*)0xFA016518u)
/** Alias (User Manual Name) for MCDS_SPBAC1_MSK.
* To use register names with standard convension, please use MCDS_SPBAC1_MSK.
*/
#define MCDS_SPBACMSK1 (MCDS_SPBAC1_MSK)

/** \brief 6520, Comparator Bound Register 2 */
#define MCDS_SPBAC2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_BND*)0xFA016520u)
/** Alias (User Manual Name) for MCDS_SPBAC2_BND.
* To use register names with standard convension, please use MCDS_SPBAC2_BND.
*/
#define MCDS_SPBACBND2 (MCDS_SPBAC2_BND)

/** \brief 6524, Comparator Range Register 2 */
#define MCDS_SPBAC2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_RNG*)0xFA016524u)
/** Alias (User Manual Name) for MCDS_SPBAC2_RNG.
* To use register names with standard convension, please use MCDS_SPBAC2_RNG.
*/
#define MCDS_SPBACRNG2 (MCDS_SPBAC2_RNG)

/** \brief 6528, Comparator Mask Register 2 */
#define MCDS_SPBAC2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_MSK*)0xFA016528u)
/** Alias (User Manual Name) for MCDS_SPBAC2_MSK.
* To use register names with standard convension, please use MCDS_SPBAC2_MSK.
*/
#define MCDS_SPBACMSK2 (MCDS_SPBAC2_MSK)

