Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 6530, Comparator Bound Register 3 */
#define MCDS_SPBAC3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_BND*)0xFA016530u)
/** Alias (User Manual Name) for MCDS_SPBAC3_BND.
* To use register names with standard convension, please use MCDS_SPBAC3_BND.
*/
#define MCDS_SPBACBND3 (MCDS_SPBAC3_BND)

/** \brief 6534, Comparator Range Register 3 */
#define MCDS_SPBAC3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_RNG*)0xFA016534u)
/** Alias (User Manual Name) for MCDS_SPBAC3_RNG.
* To use register names with standard convension, please use MCDS_SPBAC3_RNG.
*/
#define MCDS_SPBACRNG3 (MCDS_SPBAC3_RNG)

/** \brief 6538, Comparator Mask Register 3 */
#define MCDS_SPBAC3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_MSK*)0xFA016538u)
/** Alias (User Manual Name) for MCDS_SPBAC3_MSK.
* To use register names with standard convension, please use MCDS_SPBAC3_MSK.
*/
#define MCDS_SPBACMSK3 (MCDS_SPBAC3_MSK)

/** \brief 6800, Event Definition Register 0 */
#define MCDS_SPBEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016800u)

/** \brief 6804, Event Definition Register 1 */
#define MCDS_SPBEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016804u)

/** \brief 6808, Event Definition Register 2 */
#define MCDS_SPBEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016808u)

/** \brief 680C, Event Definition Register 3 */
#define MCDS_SPBEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA01680Cu)

/** \brief 6810, Event Definition Register 4 */
#define MCDS_SPBEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016810u)

/** \brief 6814, Event Definition Register 5 */
#define MCDS_SPBEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016814u)

/** \brief 6818, Event Definition Register 6 */
#define MCDS_SPBEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016818u)

/** \brief 681C, Event Definition Register 7 */
#define MCDS_SPBEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA01681Cu)

/** \brief 6820, Event Definition Register 8 */
#define MCDS_SPBEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016820u)

/** \brief 6824, Event Definition Register 9 */
#define MCDS_SPBEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016824u)

/** \brief 6828, Event Definition Register 10 */
#define MCDS_SPBEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016828u)

/** \brief 682C, Event Definition Register 11 */
#define MCDS_SPBEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA01682Cu)

/** \brief 6830, Event Definition Register 12 */
#define MCDS_SPBEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016830u)

/** \brief 6834, Event Definition Register 13 */
#define MCDS_SPBEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016834u)

/** \brief 6838, Event Definition Register 14 */
#define MCDS_SPBEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016838u)

/** \brief 683C, Event Definition Register 15 */
#define MCDS_SPBEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA01683Cu)

/** \brief 6880, Action Definition Register 0 */
#define MCDS_SPBACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016880u)

/** \brief 6884, Action Definition Register 1 */
#define MCDS_SPBACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016884u)

/** \brief 6888, Action Definition Register 2 */
#define MCDS_SPBACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016888u)

/** \brief 688C, Action Definition Register 3 */
#define MCDS_SPBACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA01688Cu)

/** \brief 6890, Action Definition Register 4 */
#define MCDS_SPBACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016890u)

/** \brief 6894, Action Definition Register 5 */
#define MCDS_SPBACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016894u)

/** \brief 6898, Action Definition Register 6 */
#define MCDS_SPBACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016898u)

/** \brief 689C, Action Definition Register 7 */
#define MCDS_SPBACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA01689Cu)

/** \brief 68A0, Action Definition Register 8 */
#define MCDS_SPBACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168A0u)

/** \brief 68A4, Action Definition Register 9 */
#define MCDS_SPBACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168A4u)

/** \brief 68A8, Action Definition Register 10 */
#define MCDS_SPBACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168A8u)

/** \brief 68AC, Action Definition Register 11 */
#define MCDS_SPBACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168ACu)

/** \brief 68B0, Action Definition Register 12 */
#define MCDS_SPBACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168B0u)

/** \brief 68B4, Action Definition Register 13 */
#define MCDS_SPBACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168B4u)

/** \brief 68B8, Action Definition Register 14 */
#define MCDS_SPBACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168B8u)

/** \brief 7000, Debug Status Register */
#define MCDS_SRIDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIDCSTS*)0xFA017000u)

/** \brief 7200, Lookup Table Data Register */
#define MCDS_SRI1BALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BALLUTD*)0xFA017200u)

/** \brief 7204, Lookup Table Address Register */
#define MCDS_SRI1BALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BALLUTA*)0xFA017204u)

/** \brief 7210, Lookup Table Base Register */
#define MCDS_SRI1BAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_BND*)0xFA017210u)
/** Alias (User Manual Name) for MCDS_SRI1BAL0_BND.
* To use register names with standard convension, please use MCDS_SRI1BAL0_BND.
*/
#define MCDS_SRI1BALBND0 (MCDS_SRI1BAL0_BND)

/** \brief 7214, Lookup Table Range Register */
#define MCDS_SRI1BAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_RNG*)0xFA017214u)
/** Alias (User Manual Name) for MCDS_SRI1BAL0_RNG.
* To use register names with standard convension, please use MCDS_SRI1BAL0_RNG.
*/
#define MCDS_SRI1BALRNG0 (MCDS_SRI1BAL0_RNG)

/** \brief 7218, Lookup Table Mapping Register */
#define MCDS_SRI1BAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_MAP*)0xFA017218u)
/** Alias (User Manual Name) for MCDS_SRI1BAL0_MAP.
* To use register names with standard convension, please use MCDS_SRI1BAL0_MAP.
*/
#define MCDS_SRI1BALMAP0 (MCDS_SRI1BAL0_MAP)

/** \brief 7220, Lookup Table Base Register */
#define MCDS_SRI1BAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_BND*)0xFA017220u)
/** Alias (User Manual Name) for MCDS_SRI1BAL1_BND.
* To use register names with standard convension, please use MCDS_SRI1BAL1_BND.
*/
#define MCDS_SRI1BALBND1 (MCDS_SRI1BAL1_BND)

