Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 7224, Lookup Table Range Register */
#define MCDS_SRI1BAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_RNG*)0xFA017224u)
/** Alias (User Manual Name) for MCDS_SRI1BAL1_RNG.
* To use register names with standard convension, please use MCDS_SRI1BAL1_RNG.
*/
#define MCDS_SRI1BALRNG1 (MCDS_SRI1BAL1_RNG)

/** \brief 7228, Lookup Table Mapping Register */
#define MCDS_SRI1BAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_MAP*)0xFA017228u)
/** Alias (User Manual Name) for MCDS_SRI1BAL1_MAP.
* To use register names with standard convension, please use MCDS_SRI1BAL1_MAP.
*/
#define MCDS_SRI1BALMAP1 (MCDS_SRI1BAL1_MAP)

/** \brief 7230, Lookup Table Base Register */
#define MCDS_SRI1BAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_BND*)0xFA017230u)
/** Alias (User Manual Name) for MCDS_SRI1BAL2_BND.
* To use register names with standard convension, please use MCDS_SRI1BAL2_BND.
*/
#define MCDS_SRI1BALBND2 (MCDS_SRI1BAL2_BND)

/** \brief 7234, Lookup Table Range Register */
#define MCDS_SRI1BAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_RNG*)0xFA017234u)
/** Alias (User Manual Name) for MCDS_SRI1BAL2_RNG.
* To use register names with standard convension, please use MCDS_SRI1BAL2_RNG.
*/
#define MCDS_SRI1BALRNG2 (MCDS_SRI1BAL2_RNG)

/** \brief 7238, Lookup Table Mapping Register */
#define MCDS_SRI1BAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_MAP*)0xFA017238u)
/** Alias (User Manual Name) for MCDS_SRI1BAL2_MAP.
* To use register names with standard convension, please use MCDS_SRI1BAL2_MAP.
*/
#define MCDS_SRI1BALMAP2 (MCDS_SRI1BAL2_MAP)

/** \brief 7240, Lookup Table Base Register */
#define MCDS_SRI1BAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_BND*)0xFA017240u)
/** Alias (User Manual Name) for MCDS_SRI1BAL3_BND.
* To use register names with standard convension, please use MCDS_SRI1BAL3_BND.
*/
#define MCDS_SRI1BALBND3 (MCDS_SRI1BAL3_BND)

/** \brief 7244, Lookup Table Range Register */
#define MCDS_SRI1BAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_RNG*)0xFA017244u)
/** Alias (User Manual Name) for MCDS_SRI1BAL3_RNG.
* To use register names with standard convension, please use MCDS_SRI1BAL3_RNG.
*/
#define MCDS_SRI1BALRNG3 (MCDS_SRI1BAL3_RNG)

/** \brief 7248, Lookup Table Mapping Register */
#define MCDS_SRI1BAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_MAP*)0xFA017248u)
/** Alias (User Manual Name) for MCDS_SRI1BAL3_MAP.
* To use register names with standard convension, please use MCDS_SRI1BAL3_MAP.
*/
#define MCDS_SRI1BALMAP3 (MCDS_SRI1BAL3_MAP)

/** \brief 7300, Lookup Table Data Register */
#define MCDS_SRI2BALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BALLUTD*)0xFA017300u)

/** \brief 7304, Lookup Table Address Register */
#define MCDS_SRI2BALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BALLUTA*)0xFA017304u)

/** \brief 7310, Lookup Table Base Register */
#define MCDS_SRI2BAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_BND*)0xFA017310u)
/** Alias (User Manual Name) for MCDS_SRI2BAL0_BND.
* To use register names with standard convension, please use MCDS_SRI2BAL0_BND.
*/
#define MCDS_SRI2BALBND0 (MCDS_SRI2BAL0_BND)

/** \brief 7314, Lookup Table Range Register */
#define MCDS_SRI2BAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_RNG*)0xFA017314u)
/** Alias (User Manual Name) for MCDS_SRI2BAL0_RNG.
* To use register names with standard convension, please use MCDS_SRI2BAL0_RNG.
*/
#define MCDS_SRI2BALRNG0 (MCDS_SRI2BAL0_RNG)

/** \brief 7318, Lookup Table Mapping Register */
#define MCDS_SRI2BAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_MAP*)0xFA017318u)
/** Alias (User Manual Name) for MCDS_SRI2BAL0_MAP.
* To use register names with standard convension, please use MCDS_SRI2BAL0_MAP.
*/
#define MCDS_SRI2BALMAP0 (MCDS_SRI2BAL0_MAP)

/** \brief 7320, Lookup Table Base Register */
#define MCDS_SRI2BAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_BND*)0xFA017320u)
/** Alias (User Manual Name) for MCDS_SRI2BAL1_BND.
* To use register names with standard convension, please use MCDS_SRI2BAL1_BND.
*/
#define MCDS_SRI2BALBND1 (MCDS_SRI2BAL1_BND)

/** \brief 7324, Lookup Table Range Register */
#define MCDS_SRI2BAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_RNG*)0xFA017324u)
/** Alias (User Manual Name) for MCDS_SRI2BAL1_RNG.
* To use register names with standard convension, please use MCDS_SRI2BAL1_RNG.
*/
#define MCDS_SRI2BALRNG1 (MCDS_SRI2BAL1_RNG)

/** \brief 7328, Lookup Table Mapping Register */
#define MCDS_SRI2BAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_MAP*)0xFA017328u)
/** Alias (User Manual Name) for MCDS_SRI2BAL1_MAP.
* To use register names with standard convension, please use MCDS_SRI2BAL1_MAP.
*/
#define MCDS_SRI2BALMAP1 (MCDS_SRI2BAL1_MAP)

/** \brief 7330, Lookup Table Base Register */
#define MCDS_SRI2BAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_BND*)0xFA017330u)
/** Alias (User Manual Name) for MCDS_SRI2BAL2_BND.
* To use register names with standard convension, please use MCDS_SRI2BAL2_BND.
*/
#define MCDS_SRI2BALBND2 (MCDS_SRI2BAL2_BND)

/** \brief 7334, Lookup Table Range Register */
#define MCDS_SRI2BAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_RNG*)0xFA017334u)
/** Alias (User Manual Name) for MCDS_SRI2BAL2_RNG.
* To use register names with standard convension, please use MCDS_SRI2BAL2_RNG.
*/
#define MCDS_SRI2BALRNG2 (MCDS_SRI2BAL2_RNG)

/** \brief 7338, Lookup Table Mapping Register */
#define MCDS_SRI2BAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_MAP*)0xFA017338u)
/** Alias (User Manual Name) for MCDS_SRI2BAL2_MAP.
* To use register names with standard convension, please use MCDS_SRI2BAL2_MAP.
*/
#define MCDS_SRI2BALMAP2 (MCDS_SRI2BAL2_MAP)

/** \brief 7340, Lookup Table Base Register */
#define MCDS_SRI2BAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_BND*)0xFA017340u)
/** Alias (User Manual Name) for MCDS_SRI2BAL3_BND.
* To use register names with standard convension, please use MCDS_SRI2BAL3_BND.
*/
#define MCDS_SRI2BALBND3 (MCDS_SRI2BAL3_BND)

