Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 7344, Lookup Table Range Register */
#define MCDS_SRI2BAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_RNG*)0xFA017344u)
/** Alias (User Manual Name) for MCDS_SRI2BAL3_RNG.
* To use register names with standard convension, please use MCDS_SRI2BAL3_RNG.
*/
#define MCDS_SRI2BALRNG3 (MCDS_SRI2BAL3_RNG)

/** \brief 7348, Lookup Table Mapping Register */
#define MCDS_SRI2BAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_MAP*)0xFA017348u)
/** Alias (User Manual Name) for MCDS_SRI2BAL3_MAP.
* To use register names with standard convension, please use MCDS_SRI2BAL3_MAP.
*/
#define MCDS_SRI2BALMAP3 (MCDS_SRI2BAL3_MAP)

/** \brief 7400, Comparator Bound Register 0 */
#define MCDS_SRI1EA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_BND*)0xFA017400u)
/** Alias (User Manual Name) for MCDS_SRI1EA0_BND.
* To use register names with standard convension, please use MCDS_SRI1EA0_BND.
*/
#define MCDS_SRI1EABND0 (MCDS_SRI1EA0_BND)

/** \brief 7404, Comparator Range Register 0 */
#define MCDS_SRI1EA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_RNG*)0xFA017404u)
/** Alias (User Manual Name) for MCDS_SRI1EA0_RNG.
* To use register names with standard convension, please use MCDS_SRI1EA0_RNG.
*/
#define MCDS_SRI1EARNG0 (MCDS_SRI1EA0_RNG)

/** \brief 7410, Comparator Bound Register 1 */
#define MCDS_SRI1EA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_BND*)0xFA017410u)
/** Alias (User Manual Name) for MCDS_SRI1EA1_BND.
* To use register names with standard convension, please use MCDS_SRI1EA1_BND.
*/
#define MCDS_SRI1EABND1 (MCDS_SRI1EA1_BND)

/** \brief 7414, Comparator Range Register 1 */
#define MCDS_SRI1EA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_RNG*)0xFA017414u)
/** Alias (User Manual Name) for MCDS_SRI1EA1_RNG.
* To use register names with standard convension, please use MCDS_SRI1EA1_RNG.
*/
#define MCDS_SRI1EARNG1 (MCDS_SRI1EA1_RNG)

/** \brief 7420, Comparator Bound Register 2 */
#define MCDS_SRI1EA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_BND*)0xFA017420u)
/** Alias (User Manual Name) for MCDS_SRI1EA2_BND.
* To use register names with standard convension, please use MCDS_SRI1EA2_BND.
*/
#define MCDS_SRI1EABND2 (MCDS_SRI1EA2_BND)

/** \brief 7424, Comparator Range Register 2 */
#define MCDS_SRI1EA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_RNG*)0xFA017424u)
/** Alias (User Manual Name) for MCDS_SRI1EA2_RNG.
* To use register names with standard convension, please use MCDS_SRI1EA2_RNG.
*/
#define MCDS_SRI1EARNG2 (MCDS_SRI1EA2_RNG)

/** \brief 7430, Comparator Bound Register 3 */
#define MCDS_SRI1EA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_BND*)0xFA017430u)
/** Alias (User Manual Name) for MCDS_SRI1EA3_BND.
* To use register names with standard convension, please use MCDS_SRI1EA3_BND.
*/
#define MCDS_SRI1EABND3 (MCDS_SRI1EA3_BND)

/** \brief 7434, Comparator Range Register 3 */
#define MCDS_SRI1EA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_RNG*)0xFA017434u)
/** Alias (User Manual Name) for MCDS_SRI1EA3_RNG.
* To use register names with standard convension, please use MCDS_SRI1EA3_RNG.
*/
#define MCDS_SRI1EARNG3 (MCDS_SRI1EA3_RNG)

/** \brief 7480, Comparator Bound Register 0 */
#define MCDS_SRI1WD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_BND*)0xFA017480u)
/** Alias (User Manual Name) for MCDS_SRI1WD0_BND.
* To use register names with standard convension, please use MCDS_SRI1WD0_BND.
*/
#define MCDS_SRI1WDBND0 (MCDS_SRI1WD0_BND)

/** \brief 7484, Comparator Bound Register 0 */
#define MCDS_SRI1WD0_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HBND*)0xFA017484u)
/** Alias (User Manual Name) for MCDS_SRI1WD0_HBND.
* To use register names with standard convension, please use MCDS_SRI1WD0_HBND.
*/
#define MCDS_SRI1WDHBND0 (MCDS_SRI1WD0_HBND)

/** \brief 7488, Comparator Range Register 0 */
#define MCDS_SRI1WD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_RNG*)0xFA017488u)
/** Alias (User Manual Name) for MCDS_SRI1WD0_RNG.
* To use register names with standard convension, please use MCDS_SRI1WD0_RNG.
*/
#define MCDS_SRI1WDRNG0 (MCDS_SRI1WD0_RNG)

/** \brief 748C, Comparator Range Register 0 */
#define MCDS_SRI1WD0_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HRNG*)0xFA01748Cu)
/** Alias (User Manual Name) for MCDS_SRI1WD0_HRNG.
* To use register names with standard convension, please use MCDS_SRI1WD0_HRNG.
*/
#define MCDS_SRI1WDHRNG0 (MCDS_SRI1WD0_HRNG)

/** \brief 7490, Comparator Mask Register 0 */
#define MCDS_SRI1WD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_MSK*)0xFA017490u)
/** Alias (User Manual Name) for MCDS_SRI1WD0_MSK.
* To use register names with standard convension, please use MCDS_SRI1WD0_MSK.
*/
#define MCDS_SRI1WDMSK0 (MCDS_SRI1WD0_MSK)

/** \brief 7494, Comparator Mask Register 0 */
#define MCDS_SRI1WD0_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HMSK*)0xFA017494u)
/** Alias (User Manual Name) for MCDS_SRI1WD0_HMSK.
* To use register names with standard convension, please use MCDS_SRI1WD0_HMSK.
*/
#define MCDS_SRI1WDHMSK0 (MCDS_SRI1WD0_HMSK)

/** \brief 749C, Comparator Sign Register 0 */
#define MCDS_SRI1WD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_SGN*)0xFA01749Cu)
/** Alias (User Manual Name) for MCDS_SRI1WD0_SGN.
* To use register names with standard convension, please use MCDS_SRI1WD0_SGN.
*/
#define MCDS_SRI1WDSGN0 (MCDS_SRI1WD0_SGN)

/** \brief 74A0, Comparator Bound Register 1 */
#define MCDS_SRI1WD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_BND*)0xFA0174A0u)
/** Alias (User Manual Name) for MCDS_SRI1WD1_BND.
* To use register names with standard convension, please use MCDS_SRI1WD1_BND.
*/
#define MCDS_SRI1WDBND1 (MCDS_SRI1WD1_BND)

/** \brief 74A4, Comparator Bound Register 1 */
#define MCDS_SRI1WD1_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HBND*)0xFA0174A4u)
/** Alias (User Manual Name) for MCDS_SRI1WD1_HBND.
* To use register names with standard convension, please use MCDS_SRI1WD1_HBND.
*/
#define MCDS_SRI1WDHBND1 (MCDS_SRI1WD1_HBND)

