Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 74A8, Comparator Range Register 1 */
#define MCDS_SRI1WD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_RNG*)0xFA0174A8u)
/** Alias (User Manual Name) for MCDS_SRI1WD1_RNG.
* To use register names with standard convension, please use MCDS_SRI1WD1_RNG.
*/
#define MCDS_SRI1WDRNG1 (MCDS_SRI1WD1_RNG)

/** \brief 74AC, Comparator Range Register 1 */
#define MCDS_SRI1WD1_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HRNG*)0xFA0174ACu)
/** Alias (User Manual Name) for MCDS_SRI1WD1_HRNG.
* To use register names with standard convension, please use MCDS_SRI1WD1_HRNG.
*/
#define MCDS_SRI1WDHRNG1 (MCDS_SRI1WD1_HRNG)

/** \brief 74B0, Comparator Mask Register 1 */
#define MCDS_SRI1WD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_MSK*)0xFA0174B0u)
/** Alias (User Manual Name) for MCDS_SRI1WD1_MSK.
* To use register names with standard convension, please use MCDS_SRI1WD1_MSK.
*/
#define MCDS_SRI1WDMSK1 (MCDS_SRI1WD1_MSK)

/** \brief 74B4, Comparator Mask Register 1 */
#define MCDS_SRI1WD1_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HMSK*)0xFA0174B4u)
/** Alias (User Manual Name) for MCDS_SRI1WD1_HMSK.
* To use register names with standard convension, please use MCDS_SRI1WD1_HMSK.
*/
#define MCDS_SRI1WDHMSK1 (MCDS_SRI1WD1_HMSK)

/** \brief 74BC, Comparator Sign Register 1 */
#define MCDS_SRI1WD1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_SGN*)0xFA0174BCu)
/** Alias (User Manual Name) for MCDS_SRI1WD1_SGN.
* To use register names with standard convension, please use MCDS_SRI1WD1_SGN.
*/
#define MCDS_SRI1WDSGN1 (MCDS_SRI1WD1_SGN)

/** \brief 74C0, Comparator Bound Register 2 */
#define MCDS_SRI1WD2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_BND*)0xFA0174C0u)
/** Alias (User Manual Name) for MCDS_SRI1WD2_BND.
* To use register names with standard convension, please use MCDS_SRI1WD2_BND.
*/
#define MCDS_SRI1WDBND2 (MCDS_SRI1WD2_BND)

/** \brief 74C4, Comparator Bound Register 2 */
#define MCDS_SRI1WD2_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HBND*)0xFA0174C4u)
/** Alias (User Manual Name) for MCDS_SRI1WD2_HBND.
* To use register names with standard convension, please use MCDS_SRI1WD2_HBND.
*/
#define MCDS_SRI1WDHBND2 (MCDS_SRI1WD2_HBND)

/** \brief 74C8, Comparator Range Register 2 */
#define MCDS_SRI1WD2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_RNG*)0xFA0174C8u)
/** Alias (User Manual Name) for MCDS_SRI1WD2_RNG.
* To use register names with standard convension, please use MCDS_SRI1WD2_RNG.
*/
#define MCDS_SRI1WDRNG2 (MCDS_SRI1WD2_RNG)

/** \brief 74CC, Comparator Range Register 2 */
#define MCDS_SRI1WD2_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HRNG*)0xFA0174CCu)
/** Alias (User Manual Name) for MCDS_SRI1WD2_HRNG.
* To use register names with standard convension, please use MCDS_SRI1WD2_HRNG.
*/
#define MCDS_SRI1WDHRNG2 (MCDS_SRI1WD2_HRNG)

/** \brief 74D0, Comparator Mask Register 2 */
#define MCDS_SRI1WD2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_MSK*)0xFA0174D0u)
/** Alias (User Manual Name) for MCDS_SRI1WD2_MSK.
* To use register names with standard convension, please use MCDS_SRI1WD2_MSK.
*/
#define MCDS_SRI1WDMSK2 (MCDS_SRI1WD2_MSK)

/** \brief 74D4, Comparator Mask Register 2 */
#define MCDS_SRI1WD2_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HMSK*)0xFA0174D4u)
/** Alias (User Manual Name) for MCDS_SRI1WD2_HMSK.
* To use register names with standard convension, please use MCDS_SRI1WD2_HMSK.
*/
#define MCDS_SRI1WDHMSK2 (MCDS_SRI1WD2_HMSK)

/** \brief 74DC, Comparator Sign Register 2 */
#define MCDS_SRI1WD2_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_SGN*)0xFA0174DCu)
/** Alias (User Manual Name) for MCDS_SRI1WD2_SGN.
* To use register names with standard convension, please use MCDS_SRI1WD2_SGN.
*/
#define MCDS_SRI1WDSGN2 (MCDS_SRI1WD2_SGN)

/** \brief 74E0, Comparator Bound Register 3 */
#define MCDS_SRI1WD3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_BND*)0xFA0174E0u)
/** Alias (User Manual Name) for MCDS_SRI1WD3_BND.
* To use register names with standard convension, please use MCDS_SRI1WD3_BND.
*/
#define MCDS_SRI1WDBND3 (MCDS_SRI1WD3_BND)

/** \brief 74E4, Comparator Bound Register 3 */
#define MCDS_SRI1WD3_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HBND*)0xFA0174E4u)
/** Alias (User Manual Name) for MCDS_SRI1WD3_HBND.
* To use register names with standard convension, please use MCDS_SRI1WD3_HBND.
*/
#define MCDS_SRI1WDHBND3 (MCDS_SRI1WD3_HBND)

/** \brief 74E8, Comparator Range Register 3 */
#define MCDS_SRI1WD3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_RNG*)0xFA0174E8u)
/** Alias (User Manual Name) for MCDS_SRI1WD3_RNG.
* To use register names with standard convension, please use MCDS_SRI1WD3_RNG.
*/
#define MCDS_SRI1WDRNG3 (MCDS_SRI1WD3_RNG)

/** \brief 74EC, Comparator Range Register 3 */
#define MCDS_SRI1WD3_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HRNG*)0xFA0174ECu)
/** Alias (User Manual Name) for MCDS_SRI1WD3_HRNG.
* To use register names with standard convension, please use MCDS_SRI1WD3_HRNG.
*/
#define MCDS_SRI1WDHRNG3 (MCDS_SRI1WD3_HRNG)

/** \brief 74F0, Comparator Mask Register 3 */
#define MCDS_SRI1WD3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_MSK*)0xFA0174F0u)
/** Alias (User Manual Name) for MCDS_SRI1WD3_MSK.
* To use register names with standard convension, please use MCDS_SRI1WD3_MSK.
*/
#define MCDS_SRI1WDMSK3 (MCDS_SRI1WD3_MSK)

/** \brief 74F4, Comparator Mask Register 3 */
#define MCDS_SRI1WD3_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HMSK*)0xFA0174F4u)
/** Alias (User Manual Name) for MCDS_SRI1WD3_HMSK.
* To use register names with standard convension, please use MCDS_SRI1WD3_HMSK.
*/
#define MCDS_SRI1WDHMSK3 (MCDS_SRI1WD3_HMSK)

/** \brief 74FC, Comparator Sign Register 3 */
#define MCDS_SRI1WD3_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_SGN*)0xFA0174FCu)
/** Alias (User Manual Name) for MCDS_SRI1WD3_SGN.
* To use register names with standard convension, please use MCDS_SRI1WD3_SGN.
*/
#define MCDS_SRI1WDSGN3 (MCDS_SRI1WD3_SGN)

/** \brief 7500, Comparator Bound Register 0 */
#define MCDS_SRI1AC0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_BND*)0xFA017500u)
/** Alias (User Manual Name) for MCDS_SRI1AC0_BND.
* To use register names with standard convension, please use MCDS_SRI1AC0_BND.
*/
#define MCDS_SRI1ACBND0 (MCDS_SRI1AC0_BND)

/** \brief 7504, Comparator Range Register 0 */
#define MCDS_SRI1AC0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_RNG*)0xFA017504u)
/** Alias (User Manual Name) for MCDS_SRI1AC0_RNG.
* To use register names with standard convension, please use MCDS_SRI1AC0_RNG.
*/
#define MCDS_SRI1ACRNG0 (MCDS_SRI1AC0_RNG)

