Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 7690, Comparator Mask Register 0 */
#define MCDS_SRI2WD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_MSK*)0xFA017690u)
/** Alias (User Manual Name) for MCDS_SRI2WD0_MSK.
* To use register names with standard convension, please use MCDS_SRI2WD0_MSK.
*/
#define MCDS_SRI2WDMSK0 (MCDS_SRI2WD0_MSK)

/** \brief 7694, Comparator Mask Register 0 */
#define MCDS_SRI2WD0_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HMSK*)0xFA017694u)
/** Alias (User Manual Name) for MCDS_SRI2WD0_HMSK.
* To use register names with standard convension, please use MCDS_SRI2WD0_HMSK.
*/
#define MCDS_SRI2WDHMSK0 (MCDS_SRI2WD0_HMSK)

/** \brief 769C, Comparator Sign Register 0 */
#define MCDS_SRI2WD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_SGN*)0xFA01769Cu)
/** Alias (User Manual Name) for MCDS_SRI2WD0_SGN.
* To use register names with standard convension, please use MCDS_SRI2WD0_SGN.
*/
#define MCDS_SRI2WDSGN0 (MCDS_SRI2WD0_SGN)

/** \brief 76A0, Comparator Bound Register 1 */
#define MCDS_SRI2WD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_BND*)0xFA0176A0u)
/** Alias (User Manual Name) for MCDS_SRI2WD1_BND.
* To use register names with standard convension, please use MCDS_SRI2WD1_BND.
*/
#define MCDS_SRI2WDBND1 (MCDS_SRI2WD1_BND)

/** \brief 76A4, Comparator Bound Register 1 */
#define MCDS_SRI2WD1_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HBND*)0xFA0176A4u)
/** Alias (User Manual Name) for MCDS_SRI2WD1_HBND.
* To use register names with standard convension, please use MCDS_SRI2WD1_HBND.
*/
#define MCDS_SRI2WDHBND1 (MCDS_SRI2WD1_HBND)

/** \brief 76A8, Comparator Range Register 1 */
#define MCDS_SRI2WD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_RNG*)0xFA0176A8u)
/** Alias (User Manual Name) for MCDS_SRI2WD1_RNG.
* To use register names with standard convension, please use MCDS_SRI2WD1_RNG.
*/
#define MCDS_SRI2WDRNG1 (MCDS_SRI2WD1_RNG)

/** \brief 76AC, Comparator Range Register 1 */
#define MCDS_SRI2WD1_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HRNG*)0xFA0176ACu)
/** Alias (User Manual Name) for MCDS_SRI2WD1_HRNG.
* To use register names with standard convension, please use MCDS_SRI2WD1_HRNG.
*/
#define MCDS_SRI2WDHRNG1 (MCDS_SRI2WD1_HRNG)

/** \brief 76B0, Comparator Mask Register 1 */
#define MCDS_SRI2WD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_MSK*)0xFA0176B0u)
/** Alias (User Manual Name) for MCDS_SRI2WD1_MSK.
* To use register names with standard convension, please use MCDS_SRI2WD1_MSK.
*/
#define MCDS_SRI2WDMSK1 (MCDS_SRI2WD1_MSK)

/** \brief 76B4, Comparator Mask Register 1 */
#define MCDS_SRI2WD1_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HMSK*)0xFA0176B4u)
/** Alias (User Manual Name) for MCDS_SRI2WD1_HMSK.
* To use register names with standard convension, please use MCDS_SRI2WD1_HMSK.
*/
#define MCDS_SRI2WDHMSK1 (MCDS_SRI2WD1_HMSK)

/** \brief 76BC, Comparator Sign Register 1 */
#define MCDS_SRI2WD1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_SGN*)0xFA0176BCu)
/** Alias (User Manual Name) for MCDS_SRI2WD1_SGN.
* To use register names with standard convension, please use MCDS_SRI2WD1_SGN.
*/
#define MCDS_SRI2WDSGN1 (MCDS_SRI2WD1_SGN)

/** \brief 76C0, Comparator Bound Register 2 */
#define MCDS_SRI2WD2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_BND*)0xFA0176C0u)
/** Alias (User Manual Name) for MCDS_SRI2WD2_BND.
* To use register names with standard convension, please use MCDS_SRI2WD2_BND.
*/
#define MCDS_SRI2WDBND2 (MCDS_SRI2WD2_BND)

/** \brief 76C4, Comparator Bound Register 2 */
#define MCDS_SRI2WD2_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HBND*)0xFA0176C4u)
/** Alias (User Manual Name) for MCDS_SRI2WD2_HBND.
* To use register names with standard convension, please use MCDS_SRI2WD2_HBND.
*/
#define MCDS_SRI2WDHBND2 (MCDS_SRI2WD2_HBND)

/** \brief 76C8, Comparator Range Register 2 */
#define MCDS_SRI2WD2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_RNG*)0xFA0176C8u)
/** Alias (User Manual Name) for MCDS_SRI2WD2_RNG.
* To use register names with standard convension, please use MCDS_SRI2WD2_RNG.
*/
#define MCDS_SRI2WDRNG2 (MCDS_SRI2WD2_RNG)

/** \brief 76CC, Comparator Range Register 2 */
#define MCDS_SRI2WD2_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HRNG*)0xFA0176CCu)
/** Alias (User Manual Name) for MCDS_SRI2WD2_HRNG.
* To use register names with standard convension, please use MCDS_SRI2WD2_HRNG.
*/
#define MCDS_SRI2WDHRNG2 (MCDS_SRI2WD2_HRNG)

/** \brief 76D0, Comparator Mask Register 2 */
#define MCDS_SRI2WD2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_MSK*)0xFA0176D0u)
/** Alias (User Manual Name) for MCDS_SRI2WD2_MSK.
* To use register names with standard convension, please use MCDS_SRI2WD2_MSK.
*/
#define MCDS_SRI2WDMSK2 (MCDS_SRI2WD2_MSK)

/** \brief 76D4, Comparator Mask Register 2 */
#define MCDS_SRI2WD2_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HMSK*)0xFA0176D4u)
/** Alias (User Manual Name) for MCDS_SRI2WD2_HMSK.
* To use register names with standard convension, please use MCDS_SRI2WD2_HMSK.
*/
#define MCDS_SRI2WDHMSK2 (MCDS_SRI2WD2_HMSK)

/** \brief 76DC, Comparator Sign Register 2 */
#define MCDS_SRI2WD2_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_SGN*)0xFA0176DCu)
/** Alias (User Manual Name) for MCDS_SRI2WD2_SGN.
* To use register names with standard convension, please use MCDS_SRI2WD2_SGN.
*/
#define MCDS_SRI2WDSGN2 (MCDS_SRI2WD2_SGN)

/** \brief 76E0, Comparator Bound Register 3 */
#define MCDS_SRI2WD3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_BND*)0xFA0176E0u)
/** Alias (User Manual Name) for MCDS_SRI2WD3_BND.
* To use register names with standard convension, please use MCDS_SRI2WD3_BND.
*/
#define MCDS_SRI2WDBND3 (MCDS_SRI2WD3_BND)

/** \brief 76E4, Comparator Bound Register 3 */
#define MCDS_SRI2WD3_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HBND*)0xFA0176E4u)
/** Alias (User Manual Name) for MCDS_SRI2WD3_HBND.
* To use register names with standard convension, please use MCDS_SRI2WD3_HBND.
*/
#define MCDS_SRI2WDHBND3 (MCDS_SRI2WD3_HBND)

/** \brief 76E8, Comparator Range Register 3 */
#define MCDS_SRI2WD3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_RNG*)0xFA0176E8u)
/** Alias (User Manual Name) for MCDS_SRI2WD3_RNG.
* To use register names with standard convension, please use MCDS_SRI2WD3_RNG.
*/
#define MCDS_SRI2WDRNG3 (MCDS_SRI2WD3_RNG)

/** \brief 76EC, Comparator Range Register 3 */
#define MCDS_SRI2WD3_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HRNG*)0xFA0176ECu)
/** Alias (User Manual Name) for MCDS_SRI2WD3_HRNG.
* To use register names with standard convension, please use MCDS_SRI2WD3_HRNG.
*/
#define MCDS_SRI2WDHRNG3 (MCDS_SRI2WD3_HRNG)

/** \brief 76F0, Comparator Mask Register 3 */
#define MCDS_SRI2WD3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_MSK*)0xFA0176F0u)
/** Alias (User Manual Name) for MCDS_SRI2WD3_MSK.
* To use register names with standard convension, please use MCDS_SRI2WD3_MSK.
*/
#define MCDS_SRI2WDMSK3 (MCDS_SRI2WD3_MSK)

/** \brief 76F4, Comparator Mask Register 3 */
#define MCDS_SRI2WD3_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HMSK*)0xFA0176F4u)
/** Alias (User Manual Name) for MCDS_SRI2WD3_HMSK.
* To use register names with standard convension, please use MCDS_SRI2WD3_HMSK.
*/
#define MCDS_SRI2WDHMSK3 (MCDS_SRI2WD3_HMSK)

/** \brief 76FC, Comparator Sign Register 3 */
#define MCDS_SRI2WD3_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_SGN*)0xFA0176FCu)
/** Alias (User Manual Name) for MCDS_SRI2WD3_SGN.
* To use register names with standard convension, please use MCDS_SRI2WD3_SGN.
*/
#define MCDS_SRI2WDSGN3 (MCDS_SRI2WD3_SGN)

