Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 7700, Comparator Bound Register 0 */
#define MCDS_SRI2AC0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_BND*)0xFA017700u)
/** Alias (User Manual Name) for MCDS_SRI2AC0_BND.
* To use register names with standard convension, please use MCDS_SRI2AC0_BND.
*/
#define MCDS_SRI2ACBND0 (MCDS_SRI2AC0_BND)

/** \brief 7704, Comparator Range Register 0 */
#define MCDS_SRI2AC0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_RNG*)0xFA017704u)
/** Alias (User Manual Name) for MCDS_SRI2AC0_RNG.
* To use register names with standard convension, please use MCDS_SRI2AC0_RNG.
*/
#define MCDS_SRI2ACRNG0 (MCDS_SRI2AC0_RNG)

/** \brief 7708, Comparator Mask Register 0 */
#define MCDS_SRI2AC0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_MSK*)0xFA017708u)
/** Alias (User Manual Name) for MCDS_SRI2AC0_MSK.
* To use register names with standard convension, please use MCDS_SRI2AC0_MSK.
*/
#define MCDS_SRI2ACMSK0 (MCDS_SRI2AC0_MSK)

/** \brief 7710, Comparator Bound Register 1 */
#define MCDS_SRI2AC1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_BND*)0xFA017710u)
/** Alias (User Manual Name) for MCDS_SRI2AC1_BND.
* To use register names with standard convension, please use MCDS_SRI2AC1_BND.
*/
#define MCDS_SRI2ACBND1 (MCDS_SRI2AC1_BND)

/** \brief 7714, Comparator Range Register 1 */
#define MCDS_SRI2AC1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_RNG*)0xFA017714u)
/** Alias (User Manual Name) for MCDS_SRI2AC1_RNG.
* To use register names with standard convension, please use MCDS_SRI2AC1_RNG.
*/
#define MCDS_SRI2ACRNG1 (MCDS_SRI2AC1_RNG)

/** \brief 7718, Comparator Mask Register 1 */
#define MCDS_SRI2AC1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_MSK*)0xFA017718u)
/** Alias (User Manual Name) for MCDS_SRI2AC1_MSK.
* To use register names with standard convension, please use MCDS_SRI2AC1_MSK.
*/
#define MCDS_SRI2ACMSK1 (MCDS_SRI2AC1_MSK)

/** \brief 7720, Comparator Bound Register 2 */
#define MCDS_SRI2AC2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_BND*)0xFA017720u)
/** Alias (User Manual Name) for MCDS_SRI2AC2_BND.
* To use register names with standard convension, please use MCDS_SRI2AC2_BND.
*/
#define MCDS_SRI2ACBND2 (MCDS_SRI2AC2_BND)

/** \brief 7724, Comparator Range Register 2 */
#define MCDS_SRI2AC2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_RNG*)0xFA017724u)
/** Alias (User Manual Name) for MCDS_SRI2AC2_RNG.
* To use register names with standard convension, please use MCDS_SRI2AC2_RNG.
*/
#define MCDS_SRI2ACRNG2 (MCDS_SRI2AC2_RNG)

/** \brief 7728, Comparator Mask Register 2 */
#define MCDS_SRI2AC2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_MSK*)0xFA017728u)
/** Alias (User Manual Name) for MCDS_SRI2AC2_MSK.
* To use register names with standard convension, please use MCDS_SRI2AC2_MSK.
*/
#define MCDS_SRI2ACMSK2 (MCDS_SRI2AC2_MSK)

/** \brief 7730, Comparator Bound Register 3 */
#define MCDS_SRI2AC3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_BND*)0xFA017730u)
/** Alias (User Manual Name) for MCDS_SRI2AC3_BND.
* To use register names with standard convension, please use MCDS_SRI2AC3_BND.
*/
#define MCDS_SRI2ACBND3 (MCDS_SRI2AC3_BND)

/** \brief 7734, Comparator Range Register 3 */
#define MCDS_SRI2AC3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_RNG*)0xFA017734u)
/** Alias (User Manual Name) for MCDS_SRI2AC3_RNG.
* To use register names with standard convension, please use MCDS_SRI2AC3_RNG.
*/
#define MCDS_SRI2ACRNG3 (MCDS_SRI2AC3_RNG)

/** \brief 7738, Comparator Mask Register 3 */
#define MCDS_SRI2AC3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2AC_MSK*)0xFA017738u)
/** Alias (User Manual Name) for MCDS_SRI2AC3_MSK.
* To use register names with standard convension, please use MCDS_SRI2AC3_MSK.
*/
#define MCDS_SRI2ACMSK3 (MCDS_SRI2AC3_MSK)

/** \brief 7780, DTU FIFOs Fill Level */
#define MCDS_SRI2DTUFLV /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2DTUFLV*)0xFA017780u)

/** \brief 7800, Event Definition Register 0 */
#define MCDS_SRIEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017800u)

/** \brief 7804, Event Definition Register 1 */
#define MCDS_SRIEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017804u)

/** \brief 7808, Event Definition Register 2 */
#define MCDS_SRIEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017808u)

/** \brief 780C, Event Definition Register 3 */
#define MCDS_SRIEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA01780Cu)

/** \brief 7810, Event Definition Register 4 */
#define MCDS_SRIEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017810u)

/** \brief 7814, Event Definition Register 5 */
#define MCDS_SRIEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017814u)

/** \brief 7818, Event Definition Register 6 */
#define MCDS_SRIEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017818u)

/** \brief 781C, Event Definition Register 7 */
#define MCDS_SRIEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA01781Cu)

/** \brief 7820, Event Definition Register 8 */
#define MCDS_SRIEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017820u)

/** \brief 7824, Event Definition Register 9 */
#define MCDS_SRIEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017824u)

/** \brief 7828, Event Definition Register 10 */
#define MCDS_SRIEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017828u)

/** \brief 782C, Event Definition Register 11 */
#define MCDS_SRIEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA01782Cu)

/** \brief 7830, Event Definition Register 12 */
#define MCDS_SRIEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017830u)

/** \brief 7834, Event Definition Register 13 */
#define MCDS_SRIEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017834u)

/** \brief 7838, Event Definition Register 14 */
#define MCDS_SRIEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA017838u)

