Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 8464, Comparator Range Register 6 */
#define MCDS_TCZEA6_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_RNG*)0xFA018464u)
/** Alias (User Manual Name) for MCDS_TCZEA6_RNG.
* To use register names with standard convension, please use MCDS_TCZEA6_RNG.
*/
#define MCDS_TCZEARNG6 (MCDS_TCZEA6_RNG)

/** \brief 8470, Comparator Bound Register 7 */
#define MCDS_TCZEA7_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_BND*)0xFA018470u)
/** Alias (User Manual Name) for MCDS_TCZEA7_BND.
* To use register names with standard convension, please use MCDS_TCZEA7_BND.
*/
#define MCDS_TCZEABND7 (MCDS_TCZEA7_BND)

/** \brief 8474, Comparator Range Register 7 */
#define MCDS_TCZEA7_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_RNG*)0xFA018474u)
/** Alias (User Manual Name) for MCDS_TCZEA7_RNG.
* To use register names with standard convension, please use MCDS_TCZEA7_RNG.
*/
#define MCDS_TCZEARNG7 (MCDS_TCZEA7_RNG)

/** \brief 8480, Comparator Bound Register 0 */
#define MCDS_TCZWD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_BND*)0xFA018480u)
/** Alias (User Manual Name) for MCDS_TCZWD0_BND.
* To use register names with standard convension, please use MCDS_TCZWD0_BND.
*/
#define MCDS_TCZWDBND0 (MCDS_TCZWD0_BND)

/** \brief 8484, Comparator Bound Register 0 */
#define MCDS_TCZWD0_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HBND*)0xFA018484u)
/** Alias (User Manual Name) for MCDS_TCZWD0_HBND.
* To use register names with standard convension, please use MCDS_TCZWD0_HBND.
*/
#define MCDS_TCZWDHBND0 (MCDS_TCZWD0_HBND)

/** \brief 8488, Comparator Range Register 0 */
#define MCDS_TCZWD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_RNG*)0xFA018488u)
/** Alias (User Manual Name) for MCDS_TCZWD0_RNG.
* To use register names with standard convension, please use MCDS_TCZWD0_RNG.
*/
#define MCDS_TCZWDRNG0 (MCDS_TCZWD0_RNG)

/** \brief 848C, Comparator Range Register 0 */
#define MCDS_TCZWD0_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HRNG*)0xFA01848Cu)
/** Alias (User Manual Name) for MCDS_TCZWD0_HRNG.
* To use register names with standard convension, please use MCDS_TCZWD0_HRNG.
*/
#define MCDS_TCZWDHRNG0 (MCDS_TCZWD0_HRNG)

/** \brief 8490, Comparator Mask Register 0 */
#define MCDS_TCZWD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_MSK*)0xFA018490u)
/** Alias (User Manual Name) for MCDS_TCZWD0_MSK.
* To use register names with standard convension, please use MCDS_TCZWD0_MSK.
*/
#define MCDS_TCZWDMSK0 (MCDS_TCZWD0_MSK)

/** \brief 8494, Comparator Mask Register 0 */
#define MCDS_TCZWD0_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HMSK*)0xFA018494u)
/** Alias (User Manual Name) for MCDS_TCZWD0_HMSK.
* To use register names with standard convension, please use MCDS_TCZWD0_HMSK.
*/
#define MCDS_TCZWDHMSK0 (MCDS_TCZWD0_HMSK)

/** \brief 849C, Comparator Sign Register 0 */
#define MCDS_TCZWD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_SGN*)0xFA01849Cu)
/** Alias (User Manual Name) for MCDS_TCZWD0_SGN.
* To use register names with standard convension, please use MCDS_TCZWD0_SGN.
*/
#define MCDS_TCZWDSGN0 (MCDS_TCZWD0_SGN)

/** \brief 84A0, Comparator Bound Register 1 */
#define MCDS_TCZWD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_BND*)0xFA0184A0u)
/** Alias (User Manual Name) for MCDS_TCZWD1_BND.
* To use register names with standard convension, please use MCDS_TCZWD1_BND.
*/
#define MCDS_TCZWDBND1 (MCDS_TCZWD1_BND)

/** \brief 84A4, Comparator Bound Register 1 */
#define MCDS_TCZWD1_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HBND*)0xFA0184A4u)
/** Alias (User Manual Name) for MCDS_TCZWD1_HBND.
* To use register names with standard convension, please use MCDS_TCZWD1_HBND.
*/
#define MCDS_TCZWDHBND1 (MCDS_TCZWD1_HBND)

/** \brief 84A8, Comparator Range Register 1 */
#define MCDS_TCZWD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_RNG*)0xFA0184A8u)
/** Alias (User Manual Name) for MCDS_TCZWD1_RNG.
* To use register names with standard convension, please use MCDS_TCZWD1_RNG.
*/
#define MCDS_TCZWDRNG1 (MCDS_TCZWD1_RNG)

/** \brief 84AC, Comparator Range Register 1 */
#define MCDS_TCZWD1_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HRNG*)0xFA0184ACu)
/** Alias (User Manual Name) for MCDS_TCZWD1_HRNG.
* To use register names with standard convension, please use MCDS_TCZWD1_HRNG.
*/
#define MCDS_TCZWDHRNG1 (MCDS_TCZWD1_HRNG)

/** \brief 84B0, Comparator Mask Register 1 */
#define MCDS_TCZWD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_MSK*)0xFA0184B0u)
/** Alias (User Manual Name) for MCDS_TCZWD1_MSK.
* To use register names with standard convension, please use MCDS_TCZWD1_MSK.
*/
#define MCDS_TCZWDMSK1 (MCDS_TCZWD1_MSK)

/** \brief 84B4, Comparator Mask Register 1 */
#define MCDS_TCZWD1_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HMSK*)0xFA0184B4u)
/** Alias (User Manual Name) for MCDS_TCZWD1_HMSK.
* To use register names with standard convension, please use MCDS_TCZWD1_HMSK.
*/
#define MCDS_TCZWDHMSK1 (MCDS_TCZWD1_HMSK)

/** \brief 84BC, Comparator Sign Register 1 */
#define MCDS_TCZWD1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_SGN*)0xFA0184BCu)
/** Alias (User Manual Name) for MCDS_TCZWD1_SGN.
* To use register names with standard convension, please use MCDS_TCZWD1_SGN.
*/
#define MCDS_TCZWDSGN1 (MCDS_TCZWD1_SGN)

/** \brief 84C0, Comparator Bound Register 2 */
#define MCDS_TCZWD2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_BND*)0xFA0184C0u)
/** Alias (User Manual Name) for MCDS_TCZWD2_BND.
* To use register names with standard convension, please use MCDS_TCZWD2_BND.
*/
#define MCDS_TCZWDBND2 (MCDS_TCZWD2_BND)

/** \brief 84C4, Comparator Bound Register 2 */
#define MCDS_TCZWD2_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HBND*)0xFA0184C4u)
/** Alias (User Manual Name) for MCDS_TCZWD2_HBND.
* To use register names with standard convension, please use MCDS_TCZWD2_HBND.
*/
#define MCDS_TCZWDHBND2 (MCDS_TCZWD2_HBND)

/** \brief 84C8, Comparator Range Register 2 */
#define MCDS_TCZWD2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_RNG*)0xFA0184C8u)
/** Alias (User Manual Name) for MCDS_TCZWD2_RNG.
* To use register names with standard convension, please use MCDS_TCZWD2_RNG.
*/
#define MCDS_TCZWDRNG2 (MCDS_TCZWD2_RNG)

