Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_reg.h
/** \brief 84CC, Comparator Range Register 2 */
#define MCDS_TCZWD2_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HRNG*)0xFA0184CCu)
/** Alias (User Manual Name) for MCDS_TCZWD2_HRNG.
* To use register names with standard convension, please use MCDS_TCZWD2_HRNG.
*/
#define MCDS_TCZWDHRNG2 (MCDS_TCZWD2_HRNG)

/** \brief 84D0, Comparator Mask Register 2 */
#define MCDS_TCZWD2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_MSK*)0xFA0184D0u)
/** Alias (User Manual Name) for MCDS_TCZWD2_MSK.
* To use register names with standard convension, please use MCDS_TCZWD2_MSK.
*/
#define MCDS_TCZWDMSK2 (MCDS_TCZWD2_MSK)

/** \brief 84D4, Comparator Mask Register 2 */
#define MCDS_TCZWD2_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HMSK*)0xFA0184D4u)
/** Alias (User Manual Name) for MCDS_TCZWD2_HMSK.
* To use register names with standard convension, please use MCDS_TCZWD2_HMSK.
*/
#define MCDS_TCZWDHMSK2 (MCDS_TCZWD2_HMSK)

/** \brief 84DC, Comparator Sign Register 2 */
#define MCDS_TCZWD2_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_SGN*)0xFA0184DCu)
/** Alias (User Manual Name) for MCDS_TCZWD2_SGN.
* To use register names with standard convension, please use MCDS_TCZWD2_SGN.
*/
#define MCDS_TCZWDSGN2 (MCDS_TCZWD2_SGN)

/** \brief 84E0, Comparator Bound Register 3 */
#define MCDS_TCZWD3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_BND*)0xFA0184E0u)
/** Alias (User Manual Name) for MCDS_TCZWD3_BND.
* To use register names with standard convension, please use MCDS_TCZWD3_BND.
*/
#define MCDS_TCZWDBND3 (MCDS_TCZWD3_BND)

/** \brief 84E4, Comparator Bound Register 3 */
#define MCDS_TCZWD3_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HBND*)0xFA0184E4u)
/** Alias (User Manual Name) for MCDS_TCZWD3_HBND.
* To use register names with standard convension, please use MCDS_TCZWD3_HBND.
*/
#define MCDS_TCZWDHBND3 (MCDS_TCZWD3_HBND)

/** \brief 84E8, Comparator Range Register 3 */
#define MCDS_TCZWD3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_RNG*)0xFA0184E8u)
/** Alias (User Manual Name) for MCDS_TCZWD3_RNG.
* To use register names with standard convension, please use MCDS_TCZWD3_RNG.
*/
#define MCDS_TCZWDRNG3 (MCDS_TCZWD3_RNG)

/** \brief 84EC, Comparator Range Register 3 */
#define MCDS_TCZWD3_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HRNG*)0xFA0184ECu)
/** Alias (User Manual Name) for MCDS_TCZWD3_HRNG.
* To use register names with standard convension, please use MCDS_TCZWD3_HRNG.
*/
#define MCDS_TCZWDHRNG3 (MCDS_TCZWD3_HRNG)

/** \brief 84F0, Comparator Mask Register 3 */
#define MCDS_TCZWD3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_MSK*)0xFA0184F0u)
/** Alias (User Manual Name) for MCDS_TCZWD3_MSK.
* To use register names with standard convension, please use MCDS_TCZWD3_MSK.
*/
#define MCDS_TCZWDMSK3 (MCDS_TCZWD3_MSK)

/** \brief 84F4, Comparator Mask Register 3 */
#define MCDS_TCZWD3_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_HMSK*)0xFA0184F4u)
/** Alias (User Manual Name) for MCDS_TCZWD3_HMSK.
* To use register names with standard convension, please use MCDS_TCZWD3_HMSK.
*/
#define MCDS_TCZWDHMSK3 (MCDS_TCZWD3_HMSK)

/** \brief 84FC, Comparator Sign Register 3 */
#define MCDS_TCZWD3_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZWD_SGN*)0xFA0184FCu)
/** Alias (User Manual Name) for MCDS_TCZWD3_SGN.
* To use register names with standard convension, please use MCDS_TCZWD3_SGN.
*/
#define MCDS_TCZWDSGN3 (MCDS_TCZWD3_SGN)

/** \brief 8500, Comparator Bound Register 0 */
#define MCDS_TCZAC0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_BND*)0xFA018500u)
/** Alias (User Manual Name) for MCDS_TCZAC0_BND.
* To use register names with standard convension, please use MCDS_TCZAC0_BND.
*/
#define MCDS_TCZACBND0 (MCDS_TCZAC0_BND)

/** \brief 8504, Comparator Range Register 0 */
#define MCDS_TCZAC0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_RNG*)0xFA018504u)
/** Alias (User Manual Name) for MCDS_TCZAC0_RNG.
* To use register names with standard convension, please use MCDS_TCZAC0_RNG.
*/
#define MCDS_TCZACRNG0 (MCDS_TCZAC0_RNG)

/** \brief 8508, Comparator Mask Register 0 */
#define MCDS_TCZAC0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_MSK*)0xFA018508u)
/** Alias (User Manual Name) for MCDS_TCZAC0_MSK.
* To use register names with standard convension, please use MCDS_TCZAC0_MSK.
*/
#define MCDS_TCZACMSK0 (MCDS_TCZAC0_MSK)

/** \brief 8510, Comparator Bound Register 1 */
#define MCDS_TCZAC1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_BND*)0xFA018510u)
/** Alias (User Manual Name) for MCDS_TCZAC1_BND.
* To use register names with standard convension, please use MCDS_TCZAC1_BND.
*/
#define MCDS_TCZACBND1 (MCDS_TCZAC1_BND)

/** \brief 8514, Comparator Range Register 1 */
#define MCDS_TCZAC1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_RNG*)0xFA018514u)
/** Alias (User Manual Name) for MCDS_TCZAC1_RNG.
* To use register names with standard convension, please use MCDS_TCZAC1_RNG.
*/
#define MCDS_TCZACRNG1 (MCDS_TCZAC1_RNG)

/** \brief 8518, Comparator Mask Register 1 */
#define MCDS_TCZAC1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_MSK*)0xFA018518u)
/** Alias (User Manual Name) for MCDS_TCZAC1_MSK.
* To use register names with standard convension, please use MCDS_TCZAC1_MSK.
*/
#define MCDS_TCZACMSK1 (MCDS_TCZAC1_MSK)

/** \brief 8520, Comparator Bound Register 2 */
#define MCDS_TCZAC2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_BND*)0xFA018520u)
/** Alias (User Manual Name) for MCDS_TCZAC2_BND.
* To use register names with standard convension, please use MCDS_TCZAC2_BND.
*/
#define MCDS_TCZACBND2 (MCDS_TCZAC2_BND)

/** \brief 8524, Comparator Range Register 2 */
#define MCDS_TCZAC2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_RNG*)0xFA018524u)
/** Alias (User Manual Name) for MCDS_TCZAC2_RNG.
* To use register names with standard convension, please use MCDS_TCZAC2_RNG.
*/
#define MCDS_TCZACRNG2 (MCDS_TCZAC2_RNG)

/** \brief 8528, Comparator Mask Register 2 */
#define MCDS_TCZAC2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_MSK*)0xFA018528u)
/** Alias (User Manual Name) for MCDS_TCZAC2_MSK.
* To use register names with standard convension, please use MCDS_TCZAC2_MSK.
*/
#define MCDS_TCZACMSK2 (MCDS_TCZAC2_MSK)

/** \brief 8530, Comparator Bound Register 3 */
#define MCDS_TCZAC3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_BND*)0xFA018530u)
/** Alias (User Manual Name) for MCDS_TCZAC3_BND.
* To use register names with standard convension, please use MCDS_TCZAC3_BND.
*/
#define MCDS_TCZACBND3 (MCDS_TCZAC3_BND)

